package com.gangbeng.tiandituhb.bean;

import java.io.Serializable;
import java.util.List;

/**
 * @author zhanghao
 * @date 2018-09-21
 */

public class NewSearchBean implements Serializable {
    /**
     * header : {"totalItemsCount":119,"pageItemsCount":10,"pages":12,"page":1,"maxItemsPerPage":10}
     * content : {"layername":"地名地址更新后数据","spatialReference":"EPSG:4326","fieldsSet":{"featureid":"","featurename":"","fields":[{"name":"OBJECTID","type":"integer"},{"name":"Join_Count","type":"integer"},{"name":"地市","type":"string"},{"name":"区县","type":"string"},{"name":"街道_乡镇","type":"string"},{"name":"村_居委会","type":"string"},{"name":"道路_街巷","type":"string"},{"name":"小区_地块","type":"string"},{"name":"门_楼牌","type":"string"},{"name":"兴趣点","type":"string"},{"name":"中类","type":"string"},{"name":"小类","type":"string"},{"name":"近景照片","type":"string"},{"name":"远景照片","type":"string"},{"name":"备注","type":"string"},{"name":"大类","type":"string"},{"name":"地名地址分","type":"string"},{"name":"地址编码","type":"string"},{"name":"流水号","type":"string"},{"name":"结构化地名","type":"string"},{"name":"地址","type":"string"},{"name":"类型编码","type":"string"},{"name":"yif1","type":"string"},{"name":"erf1","type":"string"},{"name":"sanf1","type":"string"},{"name":"序号","type":"double"},{"name":"类别码","type":"string"},{"name":"编码","type":"string"},{"name":"描述","type":"string"},{"name":"子码","type":"string"},{"name":"名称","type":"string"},{"name":"拼音","type":"string"},{"name":"X","type":"double"},{"name":"Y","type":"double"},{"name":"erj1","type":"string"},{"name":"sanj1","type":"string"},{"name":"主体层数","type":"double"},{"name":"地下室层数","type":"double"},{"name":"主体结构","type":"string"},{"name":"起点名称","type":"string"},{"name":"终点名称","type":"string"},{"name":"图片","type":"string"},{"name":"代码","type":"integer"},{"name":"使用月份","type":"string"},{"name":"方向","type":"double"},{"name":"F_FRAME","type":"string"},{"name":"F_IMPORTTI","type":"date"},{"name":"F_CASEID","type":"string"},{"name":"F_GUID","type":"string"},{"name":"F_YEAR","type":"string"},{"name":"F_COPIESIN","type":"integer"},{"name":"一级分类","type":"string"},{"name":"二级分类","type":"string"},{"name":"行业代码","type":"string"},{"name":"简称","type":"string"},{"name":"所属","type":"string"},{"name":"功能","type":"string"},{"name":"联系人","type":"string"},{"name":"联系电话","type":"string"},{"name":"Shape_Leng","type":"double"},{"name":"Shape_Area","type":"double"},{"name":"ORIG_FID","type":"integer"},{"name":"ID","type":"integer"},{"name":"xqd","type":"string"},{"name":"分类","type":"string"},{"name":"一级名称","type":"string"},{"name":"二级名称","type":"string"},{"name":"三级名称","type":"string"}]},"features":{"type":"FeatureCollection","features":[{"type":"Feature","id":"370","geometry":{"type":"Point","coordinates":[116.8815223989885,39.71266555270924]},"properties":{"OBJECTID":"3199","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-027","远景照片":"YJ-4402.25-500.25-027","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026440","流水号":"27","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"371","geometry":{"type":"Point","coordinates":[116.88172215164444,39.71264844554728]},"properties":{"OBJECTID":"3200","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-028","远景照片":"YJ-4402.25-500.25-028","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026441","流水号":"28","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3196","geometry":{"type":"Point","coordinates":[116.97914001160325,39.77219922010626]},"properties":{"OBJECTID":"4208","地市":"廊坊市","区县":"三河市","街道_乡镇":"泃阳镇","村_居委会":"","道路_街巷":"三香路","小区_地块":"","门_楼牌":"","兴趣点":"蒸的美味饭店","中类":"中餐","小类":"地方特色风味","近景照片":"JJ-4427.25-503.00-10.JPG","远景照片":"YJ-4427.25-503.00-10.JPG","备注":"","大类":"餐饮美食","地名地址分":"010116","地址编码":"13108210000134100030","流水号":"10","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"蒸的美味饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3392","geometry":{"type":"Point","coordinates":[117.01880176828332,39.76190368696182]},"properties":{"OBJECTID":"7983","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"绣水街","小区_地块":"","门_楼牌":"","兴趣点":"浙江老高饭店","中类":"中餐","小类":"浙江菜","近景照片":"JJ-4401.75-501.00-003","远景照片":"YJ-4401.75-501.00-003","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020006079","流水号":"3","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"010105","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"浙江老高饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3840","geometry":{"type":"Point","coordinates":[117.01833968677215,39.755816685275406]},"properties":{"OBJECTID":"2148","地市":"廊坊市","区县":"三河市","街道_乡镇":"泃阳西大街","村_居委会":"","道路_街巷":"贤人西大街","小区_地块":"阳光小区东区","门_楼牌":"","兴趣点":"战友饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4428.50-504.75-5.JPG","远景照片":"YJ-4428.50-504.75-5.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108210000251100068","流水号":"5","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"战友饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3848","geometry":{"type":"Point","coordinates":[117.01795889310606,39.742360100255745]},"properties":{"OBJECTID":"10297","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"燕灵路","小区_地块":"","门_楼牌":"","兴趣点":"占明饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4422.75-482.50-3.JPG","远景照片":"YJ-4422.75-482.50-3.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108245000005100004","流水号":"3","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"占明饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"4594","geometry":{"type":"Point","coordinates":[117.01155003265319,39.761505429464215]},"properties":{"OBJECTID":"1326","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"301省道","小区_地块":"","门_楼牌":"","兴趣点":"豫京香饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4404.25-497.50-4","远景照片":"YJ-4404.25-497.50-4","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020038046","流水号":"4","结构化地名":"河北省廊坊市香河县淑阳镇3","地址":"河北省廊坊市香河县淑阳镇3","类型编码":"010100","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"豫京香饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"5099","geometry":{"type":"Point","coordinates":[116.99998379046262,39.75608694528038]},"properties":{"OBJECTID":"7021","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"","小区_地块":"小张各庄","门_楼牌":"","兴趣点":"渝水香饭店","中类":"中餐","小类":"四川菜","近景照片":"JJ-4424.25-483.00-040.JPG","远景照片":"YJ-4424.25-483.00-040.JPG","备注":"","大类":"餐饮美食","地名地址分":"010104","地址编码":"13108245010077100054","流水号":"40","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"渝水香饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"6155","geometry":{"type":"Point","coordinates":[117.01477290871458,39.738669316787814]},"properties":{"OBJECTID":"4146","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"新华大街","小区_地块":"","门_楼牌":"","兴趣点":"银洲饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4403.00-498.75-053","远景照片":"YJ-4403.00-498.75-053","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020221048","流水号":"53","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"010100","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"银洲饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"6183","geometry":{"type":"Point","coordinates":[116.98690356161391,39.76035007151828]},"properties":{"OBJECTID":"13029","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"燕灵路","小区_地块":"","门_楼牌":"燕灵路658","兴趣点":"银泉饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4425.00-482.00-044.JPG","远景照片":"YJ-4425.00-482.00-044.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108245000005000658","流水号":"44","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"银泉饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}}]}}
     */

    private HeaderBean header;
    private ContentBean content;

    public HeaderBean getHeader() {
        return header;
    }

    public void setHeader(HeaderBean header) {
        this.header = header;
    }

    public ContentBean getContent() {
        return content;
    }

    public void setContent(ContentBean content) {
        this.content = content;
    }

    public static class HeaderBean implements Serializable {
        /**
         * totalItemsCount : 119
         * pageItemsCount : 10
         * pages : 12
         * page : 1
         * maxItemsPerPage : 10
         */

        private int totalItemsCount;
        private int pageItemsCount;
        private int pages;
        private int page;
        private int maxItemsPerPage;

        public int getTotalItemsCount() {
            return totalItemsCount;
        }

        public void setTotalItemsCount(int totalItemsCount) {
            this.totalItemsCount = totalItemsCount;
        }

        public int getPageItemsCount() {
            return pageItemsCount;
        }

        public void setPageItemsCount(int pageItemsCount) {
            this.pageItemsCount = pageItemsCount;
        }

        public int getPages() {
            return pages;
        }

        public void setPages(int pages) {
            this.pages = pages;
        }

        public int getPage() {
            return page;
        }

        public void setPage(int page) {
            this.page = page;
        }

        public int getMaxItemsPerPage() {
            return maxItemsPerPage;
        }

        public void setMaxItemsPerPage(int maxItemsPerPage) {
            this.maxItemsPerPage = maxItemsPerPage;
        }
    }

    public static class ContentBean implements Serializable {
        /**
         * layername : 地名地址更新后数据
         * spatialReference : EPSG:4326
         * fieldsSet : {"featureid":"","featurename":"","fields":[{"name":"OBJECTID","type":"integer"},{"name":"Join_Count","type":"integer"},{"name":"地市","type":"string"},{"name":"区县","type":"string"},{"name":"街道_乡镇","type":"string"},{"name":"村_居委会","type":"string"},{"name":"道路_街巷","type":"string"},{"name":"小区_地块","type":"string"},{"name":"门_楼牌","type":"string"},{"name":"兴趣点","type":"string"},{"name":"中类","type":"string"},{"name":"小类","type":"string"},{"name":"近景照片","type":"string"},{"name":"远景照片","type":"string"},{"name":"备注","type":"string"},{"name":"大类","type":"string"},{"name":"地名地址分","type":"string"},{"name":"地址编码","type":"string"},{"name":"流水号","type":"string"},{"name":"结构化地名","type":"string"},{"name":"地址","type":"string"},{"name":"类型编码","type":"string"},{"name":"yif1","type":"string"},{"name":"erf1","type":"string"},{"name":"sanf1","type":"string"},{"name":"序号","type":"double"},{"name":"类别码","type":"string"},{"name":"编码","type":"string"},{"name":"描述","type":"string"},{"name":"子码","type":"string"},{"name":"名称","type":"string"},{"name":"拼音","type":"string"},{"name":"X","type":"double"},{"name":"Y","type":"double"},{"name":"erj1","type":"string"},{"name":"sanj1","type":"string"},{"name":"主体层数","type":"double"},{"name":"地下室层数","type":"double"},{"name":"主体结构","type":"string"},{"name":"起点名称","type":"string"},{"name":"终点名称","type":"string"},{"name":"图片","type":"string"},{"name":"代码","type":"integer"},{"name":"使用月份","type":"string"},{"name":"方向","type":"double"},{"name":"F_FRAME","type":"string"},{"name":"F_IMPORTTI","type":"date"},{"name":"F_CASEID","type":"string"},{"name":"F_GUID","type":"string"},{"name":"F_YEAR","type":"string"},{"name":"F_COPIESIN","type":"integer"},{"name":"一级分类","type":"string"},{"name":"二级分类","type":"string"},{"name":"行业代码","type":"string"},{"name":"简称","type":"string"},{"name":"所属","type":"string"},{"name":"功能","type":"string"},{"name":"联系人","type":"string"},{"name":"联系电话","type":"string"},{"name":"Shape_Leng","type":"double"},{"name":"Shape_Area","type":"double"},{"name":"ORIG_FID","type":"integer"},{"name":"ID","type":"integer"},{"name":"xqd","type":"string"},{"name":"分类","type":"string"},{"name":"一级名称","type":"string"},{"name":"二级名称","type":"string"},{"name":"三级名称","type":"string"}]}
         * features : {"type":"FeatureCollection","features":[{"type":"Feature","id":"370","geometry":{"type":"Point","coordinates":[116.8815223989885,39.71266555270924]},"properties":{"OBJECTID":"3199","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-027","远景照片":"YJ-4402.25-500.25-027","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026440","流水号":"27","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"371","geometry":{"type":"Point","coordinates":[116.88172215164444,39.71264844554728]},"properties":{"OBJECTID":"3200","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-028","远景照片":"YJ-4402.25-500.25-028","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026441","流水号":"28","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3196","geometry":{"type":"Point","coordinates":[116.97914001160325,39.77219922010626]},"properties":{"OBJECTID":"4208","地市":"廊坊市","区县":"三河市","街道_乡镇":"泃阳镇","村_居委会":"","道路_街巷":"三香路","小区_地块":"","门_楼牌":"","兴趣点":"蒸的美味饭店","中类":"中餐","小类":"地方特色风味","近景照片":"JJ-4427.25-503.00-10.JPG","远景照片":"YJ-4427.25-503.00-10.JPG","备注":"","大类":"餐饮美食","地名地址分":"010116","地址编码":"13108210000134100030","流水号":"10","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"蒸的美味饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3392","geometry":{"type":"Point","coordinates":[117.01880176828332,39.76190368696182]},"properties":{"OBJECTID":"7983","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"绣水街","小区_地块":"","门_楼牌":"","兴趣点":"浙江老高饭店","中类":"中餐","小类":"浙江菜","近景照片":"JJ-4401.75-501.00-003","远景照片":"YJ-4401.75-501.00-003","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020006079","流水号":"3","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"010105","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"浙江老高饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3840","geometry":{"type":"Point","coordinates":[117.01833968677215,39.755816685275406]},"properties":{"OBJECTID":"2148","地市":"廊坊市","区县":"三河市","街道_乡镇":"泃阳西大街","村_居委会":"","道路_街巷":"贤人西大街","小区_地块":"阳光小区东区","门_楼牌":"","兴趣点":"战友饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4428.50-504.75-5.JPG","远景照片":"YJ-4428.50-504.75-5.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108210000251100068","流水号":"5","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"战友饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3848","geometry":{"type":"Point","coordinates":[117.01795889310606,39.742360100255745]},"properties":{"OBJECTID":"10297","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"燕灵路","小区_地块":"","门_楼牌":"","兴趣点":"占明饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4422.75-482.50-3.JPG","远景照片":"YJ-4422.75-482.50-3.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108245000005100004","流水号":"3","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"占明饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"4594","geometry":{"type":"Point","coordinates":[117.01155003265319,39.761505429464215]},"properties":{"OBJECTID":"1326","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"301省道","小区_地块":"","门_楼牌":"","兴趣点":"豫京香饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4404.25-497.50-4","远景照片":"YJ-4404.25-497.50-4","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020038046","流水号":"4","结构化地名":"河北省廊坊市香河县淑阳镇3","地址":"河北省廊坊市香河县淑阳镇3","类型编码":"010100","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"豫京香饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"5099","geometry":{"type":"Point","coordinates":[116.99998379046262,39.75608694528038]},"properties":{"OBJECTID":"7021","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"","小区_地块":"小张各庄","门_楼牌":"","兴趣点":"渝水香饭店","中类":"中餐","小类":"四川菜","近景照片":"JJ-4424.25-483.00-040.JPG","远景照片":"YJ-4424.25-483.00-040.JPG","备注":"","大类":"餐饮美食","地名地址分":"010104","地址编码":"13108245010077100054","流水号":"40","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"渝水香饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"6155","geometry":{"type":"Point","coordinates":[117.01477290871458,39.738669316787814]},"properties":{"OBJECTID":"4146","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"新华大街","小区_地块":"","门_楼牌":"","兴趣点":"银洲饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4403.00-498.75-053","远景照片":"YJ-4403.00-498.75-053","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020221048","流水号":"53","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"010100","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"银洲饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"6183","geometry":{"type":"Point","coordinates":[116.98690356161391,39.76035007151828]},"properties":{"OBJECTID":"13029","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"燕灵路","小区_地块":"","门_楼牌":"燕灵路658","兴趣点":"银泉饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4425.00-482.00-044.JPG","远景照片":"YJ-4425.00-482.00-044.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108245000005000658","流水号":"44","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"银泉饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}}]}
         */

        private String layername;
        private String spatialReference;
        private FieldsSetBean fieldsSet;
        private FeaturesBeanX features;

        public String getLayername() {
            return layername;
        }

        public void setLayername(String layername) {
            this.layername = layername;
        }

        public String getSpatialReference() {
            return spatialReference;
        }

        public void setSpatialReference(String spatialReference) {
            this.spatialReference = spatialReference;
        }

        public FieldsSetBean getFieldsSet() {
            return fieldsSet;
        }

        public void setFieldsSet(FieldsSetBean fieldsSet) {
            this.fieldsSet = fieldsSet;
        }

        public FeaturesBeanX getFeatures() {
            return features;
        }

        public void setFeatures(FeaturesBeanX features) {
            this.features = features;
        }

        public static class FieldsSetBean implements Serializable {
            /**
             * featureid :
             * featurename :
             * fields : [{"name":"OBJECTID","type":"integer"},{"name":"Join_Count","type":"integer"},{"name":"地市","type":"string"},{"name":"区县","type":"string"},{"name":"街道_乡镇","type":"string"},{"name":"村_居委会","type":"string"},{"name":"道路_街巷","type":"string"},{"name":"小区_地块","type":"string"},{"name":"门_楼牌","type":"string"},{"name":"兴趣点","type":"string"},{"name":"中类","type":"string"},{"name":"小类","type":"string"},{"name":"近景照片","type":"string"},{"name":"远景照片","type":"string"},{"name":"备注","type":"string"},{"name":"大类","type":"string"},{"name":"地名地址分","type":"string"},{"name":"地址编码","type":"string"},{"name":"流水号","type":"string"},{"name":"结构化地名","type":"string"},{"name":"地址","type":"string"},{"name":"类型编码","type":"string"},{"name":"yif1","type":"string"},{"name":"erf1","type":"string"},{"name":"sanf1","type":"string"},{"name":"序号","type":"double"},{"name":"类别码","type":"string"},{"name":"编码","type":"string"},{"name":"描述","type":"string"},{"name":"子码","type":"string"},{"name":"名称","type":"string"},{"name":"拼音","type":"string"},{"name":"X","type":"double"},{"name":"Y","type":"double"},{"name":"erj1","type":"string"},{"name":"sanj1","type":"string"},{"name":"主体层数","type":"double"},{"name":"地下室层数","type":"double"},{"name":"主体结构","type":"string"},{"name":"起点名称","type":"string"},{"name":"终点名称","type":"string"},{"name":"图片","type":"string"},{"name":"代码","type":"integer"},{"name":"使用月份","type":"string"},{"name":"方向","type":"double"},{"name":"F_FRAME","type":"string"},{"name":"F_IMPORTTI","type":"date"},{"name":"F_CASEID","type":"string"},{"name":"F_GUID","type":"string"},{"name":"F_YEAR","type":"string"},{"name":"F_COPIESIN","type":"integer"},{"name":"一级分类","type":"string"},{"name":"二级分类","type":"string"},{"name":"行业代码","type":"string"},{"name":"简称","type":"string"},{"name":"所属","type":"string"},{"name":"功能","type":"string"},{"name":"联系人","type":"string"},{"name":"联系电话","type":"string"},{"name":"Shape_Leng","type":"double"},{"name":"Shape_Area","type":"double"},{"name":"ORIG_FID","type":"integer"},{"name":"ID","type":"integer"},{"name":"xqd","type":"string"},{"name":"分类","type":"string"},{"name":"一级名称","type":"string"},{"name":"二级名称","type":"string"},{"name":"三级名称","type":"string"}]
             */

            private String featureid;
            private String featurename;
            private List<FieldsBean> fields;

            public String getFeatureid() {
                return featureid;
            }

            public void setFeatureid(String featureid) {
                this.featureid = featureid;
            }

            public String getFeaturename() {
                return featurename;
            }

            public void setFeaturename(String featurename) {
                this.featurename = featurename;
            }

            public List<FieldsBean> getFields() {
                return fields;
            }

            public void setFields(List<FieldsBean> fields) {
                this.fields = fields;
            }

            public static class FieldsBean implements Serializable {
                /**
                 * name : OBJECTID
                 * type : integer
                 */

                private String name;
                private String type;

                public String getName() {
                    return name;
                }

                public void setName(String name) {
                    this.name = name;
                }

                public String getType() {
                    return type;
                }

                public void setType(String type) {
                    this.type = type;
                }
            }
        }

        public static class FeaturesBeanX implements Serializable {
            /**
             * type : FeatureCollection
             * features : [{"type":"Feature","id":"370","geometry":{"type":"Point","coordinates":[116.8815223989885,39.71266555270924]},"properties":{"OBJECTID":"3199","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-027","远景照片":"YJ-4402.25-500.25-027","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026440","流水号":"27","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"371","geometry":{"type":"Point","coordinates":[116.88172215164444,39.71264844554728]},"properties":{"OBJECTID":"3200","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-028","远景照片":"YJ-4402.25-500.25-028","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026441","流水号":"28","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3196","geometry":{"type":"Point","coordinates":[116.97914001160325,39.77219922010626]},"properties":{"OBJECTID":"4208","地市":"廊坊市","区县":"三河市","街道_乡镇":"泃阳镇","村_居委会":"","道路_街巷":"三香路","小区_地块":"","门_楼牌":"","兴趣点":"蒸的美味饭店","中类":"中餐","小类":"地方特色风味","近景照片":"JJ-4427.25-503.00-10.JPG","远景照片":"YJ-4427.25-503.00-10.JPG","备注":"","大类":"餐饮美食","地名地址分":"010116","地址编码":"13108210000134100030","流水号":"10","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"蒸的美味饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3392","geometry":{"type":"Point","coordinates":[117.01880176828332,39.76190368696182]},"properties":{"OBJECTID":"7983","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"绣水街","小区_地块":"","门_楼牌":"","兴趣点":"浙江老高饭店","中类":"中餐","小类":"浙江菜","近景照片":"JJ-4401.75-501.00-003","远景照片":"YJ-4401.75-501.00-003","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020006079","流水号":"3","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"010105","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"浙江老高饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3840","geometry":{"type":"Point","coordinates":[117.01833968677215,39.755816685275406]},"properties":{"OBJECTID":"2148","地市":"廊坊市","区县":"三河市","街道_乡镇":"泃阳西大街","村_居委会":"","道路_街巷":"贤人西大街","小区_地块":"阳光小区东区","门_楼牌":"","兴趣点":"战友饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4428.50-504.75-5.JPG","远景照片":"YJ-4428.50-504.75-5.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108210000251100068","流水号":"5","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"战友饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"3848","geometry":{"type":"Point","coordinates":[117.01795889310606,39.742360100255745]},"properties":{"OBJECTID":"10297","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"燕灵路","小区_地块":"","门_楼牌":"","兴趣点":"占明饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4422.75-482.50-3.JPG","远景照片":"YJ-4422.75-482.50-3.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108245000005100004","流水号":"3","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"占明饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"4594","geometry":{"type":"Point","coordinates":[117.01155003265319,39.761505429464215]},"properties":{"OBJECTID":"1326","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"301省道","小区_地块":"","门_楼牌":"","兴趣点":"豫京香饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4404.25-497.50-4","远景照片":"YJ-4404.25-497.50-4","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020038046","流水号":"4","结构化地名":"河北省廊坊市香河县淑阳镇3","地址":"河北省廊坊市香河县淑阳镇3","类型编码":"010100","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"豫京香饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"5099","geometry":{"type":"Point","coordinates":[116.99998379046262,39.75608694528038]},"properties":{"OBJECTID":"7021","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"","小区_地块":"小张各庄","门_楼牌":"","兴趣点":"渝水香饭店","中类":"中餐","小类":"四川菜","近景照片":"JJ-4424.25-483.00-040.JPG","远景照片":"YJ-4424.25-483.00-040.JPG","备注":"","大类":"餐饮美食","地名地址分":"010104","地址编码":"13108245010077100054","流水号":"40","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"渝水香饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"6155","geometry":{"type":"Point","coordinates":[117.01477290871458,39.738669316787814]},"properties":{"OBJECTID":"4146","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"新华大街","小区_地块":"","门_楼牌":"","兴趣点":"银洲饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4403.00-498.75-053","远景照片":"YJ-4403.00-498.75-053","备注":"","大类":"餐饮美食","地名地址分":"1156274011","地址编码":"13102410020221048","流水号":"53","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"010100","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"银洲饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}},{"type":"Feature","id":"6183","geometry":{"type":"Point","coordinates":[116.98690356161391,39.76035007151828]},"properties":{"OBJECTID":"13029","地市":"廊坊市","区县":"三河市","街道_乡镇":"燕郊镇","村_居委会":"","道路_街巷":"燕灵路","小区_地块":"","门_楼牌":"燕灵路658","兴趣点":"银泉饭店","中类":"中餐","小类":"中餐厅","近景照片":"JJ-4425.00-482.00-044.JPG","远景照片":"YJ-4425.00-482.00-044.JPG","备注":"","大类":"餐饮美食","地名地址分":"010100","地址编码":"13108245000005000658","流水号":"44","结构化地名":"","地址":"","类型编码":"","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"银泉饭店","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}}]
             */

            private String type;
            private List<FeaturesBean> features;

            public String getType() {
                return type;
            }

            public void setType(String type) {
                this.type = type;
            }

            public List<FeaturesBean> getFeatures() {
                return features;
            }

            public void setFeatures(List<FeaturesBean> features) {
                this.features = features;
            }

            public static class FeaturesBean implements Serializable {
                /**
                 * type : Feature
                 * id : 370
                 * geometry : {"type":"Point","coordinates":[116.8815223989885,39.71266555270924]}
                 * properties : {"OBJECTID":"3199","地市":"廊坊市","区县":"香河县","街道_乡镇":"淑阳镇","村_居委会":"","道路_街巷":"康宁路","小区_地块":"","门_楼牌":"","兴趣点":"紫伦饭店站","中类":"班车站","小类":"班车站","近景照片":"JJ-4402.25-500.25-027","远景照片":"YJ-4402.25-500.25-027","备注":"3路:八户-潮北新城 4路:汽","大类":"交通设施","地名地址分":"1156235311","地址编码":"13102410020026440","流水号":"27","结构化地名":"河北省廊坊市香河县淑阳镇","地址":"河北省廊坊市香河县淑阳镇","类型编码":"120900","序号":"0.000000","类别码":"","编码":"","描述":"","子码":"","名称":"","拼音":"","X":"0.000000","Y":"0.000000","主体层数":"0.000000","地下室层数":"0.000000","主体结构":"","起点名称":"","终点名称":"","图片":"","代码":"0","使用月份":"","方向":"0.00000000000","F_FRAME":"","F_IMPORTTI":"","F_CASEID":"","F_GUID":"","F_YEAR":"","F_COPIESIN":"0","一级分类":"","二级分类":"","行业代码":"","简称":"紫伦饭店站","所属":"","功能":"","联系人":"","联系电话":"","ORIG_FID":"0","ID":"0","分类":"","一级名称":"","二级名称":"","三级名称":""}
                 */

                private String type;
                private String id;
                private GeometryBean geometry;
                private PropertiesBean properties;

                public String getType() {
                    return type;
                }

                public void setType(String type) {
                    this.type = type;
                }

                public String getId() {
                    return id;
                }

                public void setId(String id) {
                    this.id = id;
                }

                public GeometryBean getGeometry() {
                    return geometry;
                }

                public void setGeometry(GeometryBean geometry) {
                    this.geometry = geometry;
                }

                public PropertiesBean getProperties() {
                    return properties;
                }

                public void setProperties(PropertiesBean properties) {
                    this.properties = properties;
                }

                public static class GeometryBean implements Serializable {
                    /**
                     * type : Point
                     * coordinates : [116.8815223989885,39.71266555270924]
                     */

                    private String type;
                    private List<Double> coordinates;

                    public String getType() {
                        return type;
                    }

                    public void setType(String type) {
                        this.type = type;
                    }

                    public List<Double> getCoordinates() {
                        return coordinates;
                    }

                    public void setCoordinates(List<Double> coordinates) {
                        this.coordinates = coordinates;
                    }
                }

                public static class PropertiesBean implements Serializable {
                    /**
                     * OBJECTID : 3199
                     * 地市 : 廊坊市
                     * 区县 : 香河县
                     * 街道_乡镇 : 淑阳镇
                     * 村_居委会 :
                     * 道路_街巷 : 康宁路
                     * 小区_地块 :
                     * 门_楼牌 :
                     * 兴趣点 : 紫伦饭店站
                     * 中类 : 班车站
                     * 小类 : 班车站
                     * 近景照片 : JJ-4402.25-500.25-027
                     * 远景照片 : YJ-4402.25-500.25-027
                     * 备注 : 3路:八户-潮北新城 4路:汽
                     * 大类 : 交通设施
                     * 地名地址分 : 1156235311
                     * 地址编码 : 13102410020026440
                     * 流水号 : 27
                     * 结构化地名 : 河北省廊坊市香河县淑阳镇
                     * 地址 : 河北省廊坊市香河县淑阳镇
                     * 类型编码 : 120900
                     * 序号 : 0.000000
                     * 类别码 :
                     * 编码 :
                     * 描述 :
                     * 子码 :
                     * 名称 :
                     * 拼音 :
                     * X : 0.000000
                     * Y : 0.000000
                     * 主体层数 : 0.000000
                     * 地下室层数 : 0.000000
                     * 主体结构 :
                     * 起点名称 :
                     * 终点名称 :
                     * 图片 :
                     * 代码 : 0
                     * 使用月份 :
                     * 方向 : 0.00000000000
                     * F_FRAME :
                     * F_IMPORTTI :
                     * F_CASEID :
                     * F_GUID :
                     * F_YEAR :
                     * F_COPIESIN : 0
                     * 一级分类 :
                     * 二级分类 :
                     * 行业代码 :
                     * 简称 : 紫伦饭店站
                     * 所属 :
                     * 功能 :
                     * 联系人 :
                     * 联系电话 :
                     * ORIG_FID : 0
                     * ID : 0
                     * 分类 :
                     * 一级名称 :
                     * 二级名称 :
                     * 三级名称 :
                     */

                    private String OBJECTID;
                    private String 地市;
                    private String 区县;
                    private String 街道_乡镇;
                    private String 村_居委会;
                    private String 道路_街巷;
                    private String 小区_地块;
                    private String 门_楼牌;
                    private String 兴趣点;
                    private String 中类;
                    private String 小类;
                    private String 近景照片;
                    private String 远景照片;
                    private String 备注;
                    private String 大类;
                    private String 地名地址分;
                    private String 地址编码;
                    private String 流水号;
                    private String 结构化地名;
                    private String 地址;
                    private String 类型编码;
                    private String 序号;
                    private String 类别码;
                    private String 编码;
                    private String 描述;
                    private String 子码;
                    private String 名称;
                    private String 拼音;
                    private String X;
                    private String Y;
                    private String 主体层数;
                    private String 地下室层数;
                    private String 主体结构;
                    private String 起点名称;
                    private String 终点名称;
                    private String 图片;
                    private String 代码;
                    private String 使用月份;
                    private String 方向;
                    private String F_FRAME;
                    private String F_IMPORTTI;
                    private String F_CASEID;
                    private String F_GUID;
                    private String F_YEAR;
                    private String F_COPIESIN;
                    private String 一级分类;
                    private String 二级分类;
                    private String 行业代码;
                    private String 简称;
                    private String 所属;
                    private String 功能;
                    private String 联系人;
                    private String 联系电话;
                    private String ORIG_FID;
                    private String ID;
                    private String 分类;
                    private String 一级名称;
                    private String 二级名称;
                    private String 三级名称;

                    public String getOBJECTID() {
                        return OBJECTID;
                    }

                    public void setOBJECTID(String OBJECTID) {
                        this.OBJECTID = OBJECTID;
                    }

                    public String get地市() {
                        return 地市;
                    }

                    public void set地市(String 地市) {
                        this.地市 = 地市;
                    }

                    public String get区县() {
                        return 区县;
                    }

                    public void set区县(String 区县) {
                        this.区县 = 区县;
                    }

                    public String get街道_乡镇() {
                        return 街道_乡镇;
                    }

                    public void set街道_乡镇(String 街道_乡镇) {
                        this.街道_乡镇 = 街道_乡镇;
                    }

                    public String get村_居委会() {
                        return 村_居委会;
                    }

                    public void set村_居委会(String 村_居委会) {
                        this.村_居委会 = 村_居委会;
                    }

                    public String get道路_街巷() {
                        return 道路_街巷;
                    }

                    public void set道路_街巷(String 道路_街巷) {
                        this.道路_街巷 = 道路_街巷;
                    }

                    public String get小区_地块() {
                        return 小区_地块;
                    }

                    public void set小区_地块(String 小区_地块) {
                        this.小区_地块 = 小区_地块;
                    }

                    public String get门_楼牌() {
                        return 门_楼牌;
                    }

                    public void set门_楼牌(String 门_楼牌) {
                        this.门_楼牌 = 门_楼牌;
                    }

                    public String get兴趣点() {
                        return 兴趣点;
                    }

                    public void set兴趣点(String 兴趣点) {
                        this.兴趣点 = 兴趣点;
                    }

                    public String get中类() {
                        return 中类;
                    }

                    public void set中类(String 中类) {
                        this.中类 = 中类;
                    }

                    public String get小类() {
                        return 小类;
                    }

                    public void set小类(String 小类) {
                        this.小类 = 小类;
                    }

                    public String get近景照片() {
                        return 近景照片;
                    }

                    public void set近景照片(String 近景照片) {
                        this.近景照片 = 近景照片;
                    }

                    public String get远景照片() {
                        return 远景照片;
                    }

                    public void set远景照片(String 远景照片) {
                        this.远景照片 = 远景照片;
                    }

                    public String get备注() {
                        return 备注;
                    }

                    public void set备注(String 备注) {
                        this.备注 = 备注;
                    }

                    public String get大类() {
                        return 大类;
                    }

                    public void set大类(String 大类) {
                        this.大类 = 大类;
                    }

                    public String get地名地址分() {
                        return 地名地址分;
                    }

                    public void set地名地址分(String 地名地址分) {
                        this.地名地址分 = 地名地址分;
                    }

                    public String get地址编码() {
                        return 地址编码;
                    }

                    public void set地址编码(String 地址编码) {
                        this.地址编码 = 地址编码;
                    }

                    public String get流水号() {
                        return 流水号;
                    }

                    public void set流水号(String 流水号) {
                        this.流水号 = 流水号;
                    }

                    public String get结构化地名() {
                        return 结构化地名;
                    }

                    public void set结构化地名(String 结构化地名) {
                        this.结构化地名 = 结构化地名;
                    }

                    public String get地址() {
                        return 地址;
                    }

                    public void set地址(String 地址) {
                        this.地址 = 地址;
                    }

                    public String get类型编码() {
                        return 类型编码;
                    }

                    public void set类型编码(String 类型编码) {
                        this.类型编码 = 类型编码;
                    }

                    public String get序号() {
                        return 序号;
                    }

                    public void set序号(String 序号) {
                        this.序号 = 序号;
                    }

                    public String get类别码() {
                        return 类别码;
                    }

                    public void set类别码(String 类别码) {
                        this.类别码 = 类别码;
                    }

                    public String get编码() {
                        return 编码;
                    }

                    public void set编码(String 编码) {
                        this.编码 = 编码;
                    }

                    public String get描述() {
                        return 描述;
                    }

                    public void set描述(String 描述) {
                        this.描述 = 描述;
                    }

                    public String get子码() {
                        return 子码;
                    }

                    public void set子码(String 子码) {
                        this.子码 = 子码;
                    }

                    public String get名称() {
                        return 名称;
                    }

                    public void set名称(String 名称) {
                        this.名称 = 名称;
                    }

                    public String get拼音() {
                        return 拼音;
                    }

                    public void set拼音(String 拼音) {
                        this.拼音 = 拼音;
                    }

                    public String getX() {
                        return X;
                    }

                    public void setX(String X) {
                        this.X = X;
                    }

                    public String getY() {
                        return Y;
                    }

                    public void setY(String Y) {
                        this.Y = Y;
                    }

                    public String get主体层数() {
                        return 主体层数;
                    }

                    public void set主体层数(String 主体层数) {
                        this.主体层数 = 主体层数;
                    }

                    public String get地下室层数() {
                        return 地下室层数;
                    }

                    public void set地下室层数(String 地下室层数) {
                        this.地下室层数 = 地下室层数;
                    }

                    public String get主体结构() {
                        return 主体结构;
                    }

                    public void set主体结构(String 主体结构) {
                        this.主体结构 = 主体结构;
                    }

                    public String get起点名称() {
                        return 起点名称;
                    }

                    public void set起点名称(String 起点名称) {
                        this.起点名称 = 起点名称;
                    }

                    public String get终点名称() {
                        return 终点名称;
                    }

                    public void set终点名称(String 终点名称) {
                        this.终点名称 = 终点名称;
                    }

                    public String get图片() {
                        return 图片;
                    }

                    public void set图片(String 图片) {
                        this.图片 = 图片;
                    }

                    public String get代码() {
                        return 代码;
                    }

                    public void set代码(String 代码) {
                        this.代码 = 代码;
                    }

                    public String get使用月份() {
                        return 使用月份;
                    }

                    public void set使用月份(String 使用月份) {
                        this.使用月份 = 使用月份;
                    }

                    public String get方向() {
                        return 方向;
                    }

                    public void set方向(String 方向) {
                        this.方向 = 方向;
                    }

                    public String getF_FRAME() {
                        return F_FRAME;
                    }

                    public void setF_FRAME(String F_FRAME) {
                        this.F_FRAME = F_FRAME;
                    }

                    public String getF_IMPORTTI() {
                        return F_IMPORTTI;
                    }

                    public void setF_IMPORTTI(String F_IMPORTTI) {
                        this.F_IMPORTTI = F_IMPORTTI;
                    }

                    public String getF_CASEID() {
                        return F_CASEID;
                    }

                    public void setF_CASEID(String F_CASEID) {
                        this.F_CASEID = F_CASEID;
                    }

                    public String getF_GUID() {
                        return F_GUID;
                    }

                    public void setF_GUID(String F_GUID) {
                        this.F_GUID = F_GUID;
                    }

                    public String getF_YEAR() {
                        return F_YEAR;
                    }

                    public void setF_YEAR(String F_YEAR) {
                        this.F_YEAR = F_YEAR;
                    }

                    public String getF_COPIESIN() {
                        return F_COPIESIN;
                    }

                    public void setF_COPIESIN(String F_COPIESIN) {
                        this.F_COPIESIN = F_COPIESIN;
                    }

                    public String get一级分类() {
                        return 一级分类;
                    }

                    public void set一级分类(String 一级分类) {
                        this.一级分类 = 一级分类;
                    }

                    public String get二级分类() {
                        return 二级分类;
                    }

                    public void set二级分类(String 二级分类) {
                        this.二级分类 = 二级分类;
                    }

                    public String get行业代码() {
                        return 行业代码;
                    }

                    public void set行业代码(String 行业代码) {
                        this.行业代码 = 行业代码;
                    }

                    public String get简称() {
                        return 简称;
                    }

                    public void set简称(String 简称) {
                        this.简称 = 简称;
                    }

                    public String get所属() {
                        return 所属;
                    }

                    public void set所属(String 所属) {
                        this.所属 = 所属;
                    }

                    public String get功能() {
                        return 功能;
                    }

                    public void set功能(String 功能) {
                        this.功能 = 功能;
                    }

                    public String get联系人() {
                        return 联系人;
                    }

                    public void set联系人(String 联系人) {
                        this.联系人 = 联系人;
                    }

                    public String get联系电话() {
                        return 联系电话;
                    }

                    public void set联系电话(String 联系电话) {
                        this.联系电话 = 联系电话;
                    }

                    public String getORIG_FID() {
                        return ORIG_FID;
                    }

                    public void setORIG_FID(String ORIG_FID) {
                        this.ORIG_FID = ORIG_FID;
                    }

                    public String getID() {
                        return ID;
                    }

                    public void setID(String ID) {
                        this.ID = ID;
                    }

                    public String get分类() {
                        return 分类;
                    }

                    public void set分类(String 分类) {
                        this.分类 = 分类;
                    }

                    public String get一级名称() {
                        return 一级名称;
                    }

                    public void set一级名称(String 一级名称) {
                        this.一级名称 = 一级名称;
                    }

                    public String get二级名称() {
                        return 二级名称;
                    }

                    public void set二级名称(String 二级名称) {
                        this.二级名称 = 二级名称;
                    }

                    public String get三级名称() {
                        return 三级名称;
                    }

                    public void set三级名称(String 三级名称) {
                        this.三级名称 = 三级名称;
                    }
                }
            }
        }
    }
}
